# Зазвичай словники форматують наступним чином:
# Це поліпшує розуміння струтури словника
nameDict = {
    "Гриша": "Привіт, Григорій Батькович",  
    "Саша": "Привіт,Олександр Батькович",
    "Коля": "Привіт,Микола Батькович",
    "Костя": "Привіт,Костянтин Батькович",
    "Валєра": "Привіт,Валерій Батькович"
}
enterName = input("Введіть ім'я :")

# гарний підхід використовувати get зі значенням по замовчуванню
# також ліпше, але не обов"язково спершу передати значення зі словника в змінну
# і вже після передати його в print
# це дозволить притримуватися правила одна задача (дія) на стрічку
# і зменшує складність коду
print(nameDict.get(enterName, "Я тебе не знаю"))