# Бажано задавати імена змінним згідно їх контексту. 
# Наприклад: sum, percent, duration
# Також, сума депозиту та % можуть бути не тільки цілими числами
# Тому можна використовувати float
a = int(input("Введіть сумму вкладу ")) 
n = int(input("Введіть тривалість депозиту "))
x = int(input("Введіть % по депозиту ")) 

s = a 
# Щодо прибутку виникло недорозуміння, я мав на увазі річних
# Відповідно s = a можна не використовувати і виводити s / 100.0 * x
for i in range(0, n):
    s = s / 100.0 * x + s
    i = i + 1
    b = s - a
    print (i, "Рік", "Сума депозиту:", round(s , 2) ,"Прибуток по депозиту:",round(b ,2))
   